{
    "format": "layers-model",
    "generatedBy": "keras v2.8.0",
    "convertedBy": "TensorFlow.js Converter v3.8.0",
    "modelTopology": {
        "keras_version": "2.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "layers": [
                    {
                        "class_name": "Embedding",
                        "config": {
                            "input_dim": 100,
                            "output_dim": 32,
                            "input_length": 50,
                            "name": "embedding_1"
                        }
                    },
                    {
                        "class_name": "Conv1D",
                        "config": {
                            "filters": 64,
                            "kernel_size": 3,
                            "activation": "relu",
                            "name": "conv1d_1"
                        }
                    },
                    {
                        "class_name": "GlobalMaxPooling1D",
                        "config": {
                            "name": "global_max_pooling1d_1"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "units": 32,
                            "activation": "relu",
                            "name": "dense_1"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "units": 1,
                            "activation": "sigmoid",
                            "name": "dense_2"
                        }
                    }
                ]
            }
        }
    },
    "weightsManifest": [
        {
            "paths": ["group1-shard1of1.bin"],
            "weights": [
                {"name": "embedding_1/embeddings", "shape": [100, 32], "dtype": "float32"},
                {"name": "conv1d_1/kernel", "shape": [3, 32, 64], "dtype": "float32"},
                {"name": "conv1d_1/bias", "shape": [64], "dtype": "float32"},
                {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32"},
                {"name": "dense_1/bias", "shape": [32], "dtype": "float32"},
                {"name": "dense_2/kernel", "shape": [32, 1], "dtype": "float32"},
                {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}
            ]
        }
    ]
} 